In [1]:
import pandas as pd

In [2]:
shopping_df = pd.read_csv("resources/shopping_data.csv")
shopping_df

     CustomerID Card Member   Age  Annual Income  Spending Score (1-100)
0             1         Yes  19.0          15000                    39.0
1             2         Yes  21.0          15000                    81.0
2             3          No  20.0          16000                     6.0
3             4          No  23.0          16000                    77.0
4             5          No  31.0          17000                    40.0
..          ...         ...   ...            ...                     ...
198         199          No  35.0         120000                    79.0
199         200          No  45.0         126000                    28.0
200         201         Yes  32.0         126000                    74.0
201         202         Yes  32.0         137000                    18.0
202         203         Yes  30.0         137000                    83.0

[203 rows x 5 columns]

In [3]:
shopping_df.columns

Index(['CustomerID', 'Card Member', 'Age', 'Annual Income',
       'Spending Score (1-100)'],
      dtype='object')

In [4]:
shopping_df.dtypes

CustomerID                  int64
Card Member                object
Age                       float64
Annual Income               int64
Spending Score (1-100)    float64
dtype: object

In [5]:
# find null values
for column in shopping_df.columns:
    print(f"Column {column} has {shopping_df[column].isnull().sum()} null values")

Column CustomerID has 0 null values
Column Card Member has 2 null values
Column Age has 2 null values
Column Annual Income has 0 null values
Column Spending Score (1-100) has 1 null values

In [6]:
# drop null rows
shopping_df = shopping_df.dropna()
shopping_df

     CustomerID Card Member   Age  Annual Income  Spending Score (1-100)
0             1         Yes  19.0          15000                    39.0
1             2         Yes  21.0          15000                    81.0
2             3          No  20.0          16000                     6.0
3             4          No  23.0          16000                    77.0
4             5          No  31.0          17000                    40.0
..          ...         ...   ...            ...                     ...
198         199          No  35.0         120000                    79.0
199         200          No  45.0         126000                    28.0
200         201         Yes  32.0         126000                    74.0
201         202         Yes  32.0         137000                    18.0
202         203         Yes  30.0         137000                    83.0

[200 rows x 5 columns]

In [7]:
# print duplicate entries
print(f"Duplicate Enries = {shopping_df.duplicated().sum()}")

Duplicate Enries = 0

In [8]:
# Remove the column CustomerID
shopping_df = shopping_df.drop('CustomerID', axis = 1)
shopping_df

    Card Member   Age  Annual Income  Spending Score (1-100)
0           Yes  19.0          15000                    39.0
1           Yes  21.0          15000                    81.0
2            No  20.0          16000                     6.0
3            No  23.0          16000                    77.0
4            No  31.0          17000                    40.0
..          ...   ...            ...                     ...
198          No  35.0         120000                    79.0
199          No  45.0         126000                    28.0
200         Yes  32.0         126000                    74.0
201         Yes  32.0         137000                    18.0
202         Yes  30.0         137000                    83.0

[200 rows x 4 columns]

In [9]:
# function to change Caard Member to 1 and non-card member to 0
def change_string (member):
  if member == "Yes":
    return 1
  else:
    return 0

shopping_df["Card Member"] = shopping_df["Card Member"].apply(change_string)
shopping_df

     Card Member   Age  Annual Income  Spending Score (1-100)
0              1  19.0          15000                    39.0
1              1  21.0          15000                    81.0
2              0  20.0          16000                     6.0
3              0  23.0          16000                    77.0
4              0  31.0          17000                    40.0
..           ...   ...            ...                     ...
198            0  35.0         120000                    79.0
199            0  45.0         126000                    28.0
200            1  32.0         126000                    74.0
201            1  32.0         137000                    18.0
202            1  30.0         137000                    83.0

[200 rows x 4 columns]

In [10]:
shopping_df['Annual Income'] = shopping_df['Annual Income']/1000
shopping_df

     Card Member   Age  Annual Income  Spending Score (1-100)
0              1  19.0           15.0                    39.0
1              1  21.0           15.0                    81.0
2              0  20.0           16.0                     6.0
3              0  23.0           16.0                    77.0
4              0  31.0           17.0                    40.0
..           ...   ...            ...                     ...
198            0  35.0          120.0                    79.0
199            0  45.0          126.0                    28.0
200            1  32.0          126.0                    74.0
201            1  32.0          137.0                    18.0
202            1  30.0          137.0                    83.0

[200 rows x 4 columns]

In [11]:
#renaming many columns in one go
shopping_df.columns = ['CardMember', 'Age', 'AnnualIncome', 'SpendingScore']
shopping_df

     CardMember   Age  AnnualIncome  SpendingScore
0             1  19.0          15.0           39.0
1             1  21.0          15.0           81.0
2             0  20.0          16.0            6.0
3             0  23.0          16.0           77.0
4             0  31.0          17.0           40.0
..          ...   ...           ...            ...
198           0  35.0         120.0           79.0
199           0  45.0         126.0           28.0
200           1  32.0         126.0           74.0
201           1  32.0         137.0           18.0
202           1  30.0         137.0           83.0

[200 rows x 4 columns]

In [13]:
shopping_df.to_csv("resources/clean_shopping_df.csv", index=False)